#ifndef _CA51F1S6_CONFIG_H_
#define _CA51F1S6_CONFIG_H_
/**************************************************************************************************************/
#define IRCH				0
#define IRCL				1

/**************************************************************************************************************/
#define SYSCLK_SRC			IRCH			//芯片系统时钟选择
/**************************************************************************************************************/

/**************************************************************************************************************
	系统时钟有两个时钟可选：IRCH和IRCL，上电后，默认的系统时钟是IRCH，并且CKDIV值为1，即系统时钟上电默认为
	IRCH的二分频(8MHz)，如CPU需运行于更高频率(16MHz)，软件可设置CKDIV为0。

	工作电压说明：	
	CPU时钟为8MHz时 ，工作电压范围：2.3 ~ 5.5V
	CPU时钟为16MHz时，工作电压范围：2.7 ~ 5.5V
***************************************************************************************************************/
#if (SYSCLK_SRC == IRCH)
#define SYSCLK_16MHZ			//系统时钟跑16MHz
	
#ifdef SYSCLK_16MHZ
	#define FOSC				(16000000)
#else 
	#define FOSC				(8000000)
#endif

#elif (SYSCLK_SRC == IRCL)
	#define FOSC				(128000)
#endif
/***************************************************************************************************************/

/*************************UART功能开关宏定义*********************************************************************/
#define UART1_EN				//如果使用UART1，打开此宏定义
//#define UART2_EN				//如果使用UART2，打开此宏定义

#define PRINT_EN				//使用uart_printf函数打印使能

#ifdef PRINT_EN
 	#define UART1_PRINT			//如果使用UART1打印，打开此宏定义
//	#define UART2_PRINT			//如果使用UART2打印，打开此宏定义
			
	#ifdef UART1_PRINT
		#define UART1_EN
	#elif defined  UART2_PRINT
		#define UART2_EN
	#endif
#endif

#ifdef UART1_EN
	#define UART1_BAUTRATE		115200
#endif
#ifdef UART2_EN
	#define UART2_BAUTRATE		115200
#endif
/***************************************************************************************************************/

#endif										
