#ifndef _SYSTEM_CLOCK_C_
#define _SYSTEM_CLOCK_C_
/*********************************************************************************************************************/
#include "include/ca51f1s6_config.h"		
#include "include/ca51f1s6sfr.h"
#include "include/ca51f1s6xsfr.h"
#include "include/gpiodef_f1s6.h"

#include "include/system_clock.h"
#include "include/delay.h"
/*********************************************************************************************************************/


/***********************************************************************************
函数名  ：		Sys_Clk_Set_IRCH										 	
功能描述：		设置系统时钟为IRCH
输入参数：		无
返回值  ：		无
***********************************************************************************/
void Sys_Clk_Set_IRCH(void)
{
	CKCON |= IHCKE;											//IRCH时钟使能
	CKCON = (CKCON&0xFE) | CKSEL_IRCH;						//系统时钟切换到IRCH
}
/***********************************************************************************/


/***********************************************************************************
函数名  ：		Sys_Clk_Set_IRCL										 	
功能描述：		设置系统时钟为IRCL
输入参数：		无
返回值  ：		无
***********************************************************************************/
void Sys_Clk_Set_IRCL(void)
{
	CKCON |= ILCKE;											//IRCL时钟使能
	Delay_ms(1);											//使能IRCL后延时1ms，等待IRCL稳定
	CKCON = (CKCON&0xFE) | CKSEL_IRCL;						//系统时钟切换到IRCL	
}
/***********************************************************************************/


/***********************************************************************************
函数名  ：		ReadIHCFG										 	
功能描述：		
输入参数：		无
返回值  ：		无
***********************************************************************************/
unsigned char ReadIHCFG(void)    
{
	unsigned char D1,D2;
	FSCMD = 0x80; 
	PTSH = 0x00;    
	PTSL = 0x08;           
	FSCMD = 0x81;      
	D1 = FSDAT;
	D2 = FSDAT;
	FSCMD = 0;
	if(D1 == 'H')
	{
		return D2;
	}
	return IHCFG;
}


/***********************************************************************************
函数名  ：		ReadTKCCFG										 	
功能描述：		
输入参数：		无
返回值  ：		无
***********************************************************************************/
unsigned char ReadTKCCFG(void)    
{
	unsigned char D1,D2;
	FSCMD = 0x80; 
	PTSH = 0x00;    
	PTSL = 0x06;           
	FSCMD = 0x81;      
	D1 = FSDAT;
	D2 = FSDAT;
	FSCMD = 0;
	if(D1 == 'F')
	{
		return D2;
	}
	return TKCCFG;
}
/*********************************************************************************************************************/
#endif
